OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1776.h
#define _PWM11INTCON_PRIE       0x01
#define _PWM11INTCON_PWM11PRIE  0x01
#define _PWM11INTCON_DCIE       0x02
#define _PWM11INTCON_PWM11DCIE  0x02
#define _PWM11INTCON_PHIE       0x04
#define _PWM11INTCON_PWM11PHIE  0x04
#define _PWM11INTCON_OFIE       0x08
#define _PWM11INTCON_PWM11OFIE  0x08

//==============================================================================


//==============================================================================
//        PWM11INTE Bits

extern __at(0x0DBC) __sfr PWM11INTE;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM11PRIE          : 1;
    unsigned PWM11DCIE          : 1;
    unsigned PWM11PHIE          : 1;
    unsigned PWM11OFIE          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM11INTEbits_t;

extern __at(0x0DBC) volatile __PWM11INTEbits_t PWM11INTEbits;

#define _PWM11INTE_PRIE         0x01
#define _PWM11INTE_PWM11PRIE    0x01
#define _PWM11INTE_DCIE         0x02
#define _PWM11INTE_PWM11DCIE    0x02
#define _PWM11INTE_PHIE         0x04
#define _PWM11INTE_PWM11PHIE    0x04
#define _PWM11INTE_OFIE         0x08
#define _PWM11INTE_PWM11OFIE    0x08

//==============================================================================


//==============================================================================
//        PWM11INTF Bits

extern __at(0x0DBD) __sfr PWM11INTF;

typedef union
  {
  struct
    {
    unsigned PRIF               : 1;
    unsigned DCIF               : 1;
    unsigned PHIF               : 1;
    unsigned OFIF               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM11PRIF          : 1;
    unsigned PWM11DCIF          : 1;
    unsigned PWM11PHIF          : 1;
    unsigned PWM11OFIF          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM11INTFbits_t;

extern __at(0x0DBD) volatile __PWM11INTFbits_t PWM11INTFbits;

#define _PWM11INTF_PRIF         0x01
#define _PWM11INTF_PWM11PRIF    0x01
#define _PWM11INTF_DCIF         0x02
#define _PWM11INTF_PWM11DCIF    0x02
#define _PWM11INTF_PHIF         0x04
#define _PWM11INTF_PWM11PHIF    0x04
#define _PWM11INTF_OFIF         0x08
#define _PWM11INTF_PWM11OFIF    0x08

//==============================================================================


//==============================================================================
//        PWM11INTFLG Bits

extern __at(0x0DBD) __sfr PWM11INTFLG;

typedef union
  {
  struct
    {
    unsigned PRIF               : 1;
    unsigned DCIF               : 1;
    unsigned PHIF               : 1;
    unsigned OFIF               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM11PRIF          : 1;
    unsigned PWM11DCIF          : 1;
    unsigned PWM11PHIF          : 1;
    unsigned PWM11OFIF          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM11INTFLGbits_t;

extern __at(0x0DBD) volatile __PWM11INTFLGbits_t PWM11INTFLGbits;

#define _PWM11INTFLG_PRIF       0x01
#define _PWM11INTFLG_PWM11PRIF  0x01
#define _PWM11INTFLG_DCIF       0x02
#define _PWM11INTFLG_PWM11DCIF  0x02
#define _PWM11INTFLG_PHIF       0x04
#define _PWM11INTFLG_PWM11PHIF  0x04
#define _PWM11INTFLG_OFIF       0x08
#define _PWM11INTFLG_PWM11OFIF  0x08

//==============================================================================


//==============================================================================
//        PWM11CLKCON Bits

extern __at(0x0DBE) __sfr PWM11CLKCON;

typedef union
  {
  struct
    {
    unsigned PWM11CS0           : 1;
    unsigned PWM11CS1           : 1;
    unsigned PWM11CS2           : 1;
    unsigned                    : 1;
    unsigned PWM11PS0           : 1;
    unsigned PWM11PS1           : 1;
    unsigned PWM11PS2           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned CS2                : 1;
    unsigned                    : 1;
    unsigned PS0                : 1;
    unsigned PS1                : 1;
    unsigned PS2                : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM11CS            : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned CS                 : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PWM11PS            : 3;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PS                 : 3;
    unsigned                    : 1;
    };
  } __PWM11CLKCONbits_t;

extern __at(0x0DBE) volatile __PWM11CLKCONbits_t PWM11CLKCONbits;

#define _PWM11CLKCON_PWM11CS0   0x01
#define _PWM11CLKCON_CS0        0x01
#define _PWM11CLKCON_PWM11CS1   0x02
#define _PWM11CLKCON_CS1        0x02
#define _PWM11CLKCON_PWM11CS2   0x04
#define _PWM11CLKCON_CS2        0x04
#define _PWM11CLKCON_PWM11PS0   0x10
#define _PWM11CLKCON_PS0        0x10
#define _PWM11CLKCON_PWM11PS1   0x20
#define _PWM11CLKCON_PS1        0x20
#define _PWM11CLKCON_PWM11PS2   0x40
#define _PWM11CLKCON_PS2        0x40

//==============================================================================


//==============================================================================
//        PWM11LDCON Bits

